
<!DOCTYPE HTML>
<html lang="zh-cn" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>路径 · svg you should know</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-theme-vuejs-2/vue.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="fill_and_stroke.html" />
    
    
    <link rel="prev" href="basic_shape.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                



<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="readme.html">
            
                <a href="readme.html">
            
                    
                    SVG 绘制图形
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="sample.html">
            
                <a href="sample.html">
            
                    
                    一个 SVG 范例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="use_svg.html">
            
                <a href="use_svg.html">
            
                    
                    SVG 使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="grid.html">
            
                <a href="grid.html">
            
                    
                    坐标定位
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="basic_shape.html">
            
                <a href="basic_shape.html">
            
                    
                    基本形状
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.5" data-path="path.html">
            
                <a href="path.html">
            
                    
                    路径
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="fill_and_stroke.html">
            
                <a href="fill_and_stroke.html">
            
                    
                    填充与边框
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="gradients.html">
            
                <a href="gradients.html">
            
                    
                    渐变
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="pattens.html">
            
                <a href="pattens.html">
            
                    
                    图案
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="text.html">
            
                <a href="text.html">
            
                    
                    文字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="transformations.html">
            
                <a href="transformations.html">
            
                    
                    基本变换
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.11" data-path="cut_mask.html">
            
                <a href="cut_mask.html">
            
                    
                    剪切和遮罩
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.12" data-path="imbed_img.html">
            
                <a href="imbed_img.html">
            
                    
                    嵌入图像
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    实战
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="svg_icon.html">
            
                <a href="svg_icon.html">
            
                    
                    SVG 图标
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/chessBoard.html">
            
                <a href="../chapter2/chessBoard.html">
            
                    
                    棋盘
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../chapter2/circle.html">
            
                <a href="../chapter2/circle.html">
            
                    
                    环形百分比进度
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../chapter2/movingLogo.html">
            
                <a href="../chapter2/movingLogo.html">
            
                    
                    镂空背景动图 Logo
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../chapter2/moving_pikaqiu.html">
            
                <a href="../chapter2/moving_pikaqiu.html">
            
                    
                    会动的皮卡丘
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>



                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                

                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >路径</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8DEF;&#x5F84;">&#x8DEF;&#x5F84;</h1>
<blockquote>
<p>&#x672C;&#x6587;&#x6458;&#x5F55;&#x81EA; MDN</p>
</blockquote>
<p><code>&lt;path&gt;</code>&#x5143;&#x7D20;&#x662F;SVG&#x57FA;&#x672C;&#x5F62;&#x72B6;&#x4E2D;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x5B83;&#x4E0D;&#x4EC5;&#x80FD;&#x521B;&#x5EFA;&#x5176;&#x4ED6;&#x57FA;&#x672C;&#x5F62;&#x72B6;&#xFF0C;&#x8FD8;&#x80FD;&#x521B;&#x5EFA;&#x66F4;&#x591A;&#x5176;&#x4ED6;&#x5F62;&#x72B6;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;path&#x53EA;&#x9700;&#x8981;&#x8BBE;&#x5B9A;&#x5F88;&#x5C11;&#x7684;&#x70B9;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x5E73;&#x6ED1;&#x6D41;&#x7545;&#x7684;&#x7EBF;&#x6761;&#xFF08;&#x6BD4;&#x5982;&#x66F2;&#x7EBF;&#xFF09;&#x3002;&#x867D;&#x7136;polyline&#x5143;&#x7D20;&#x4E5F;&#x80FD;&#x5B9E;&#x73B0;&#x7C7B;&#x4F3C;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x5927;&#x91CF;&#x7684;&#x70B9;&#xFF08;&#x70B9;&#x8D8A;&#x5BC6;&#x96C6;&#xFF0C;&#x8D8A;&#x63A5;&#x8FD1;&#x8FDE;&#x7EED;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x8D8A;&#x5E73;&#x6ED1;&#x6D41;&#x7545;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x4E0D;&#x80FD;&#x591F;&#x653E;&#x5927;&#xFF08;&#x653E;&#x5927;&#x540E;&#xFF0C;&#x70B9;&#x7684;&#x79BB;&#x6563;&#x66F4;&#x660E;&#x663E;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x7ED8;&#x5236;SVG&#x65F6;&#xFF0C;&#x5BF9;&#x8DEF;&#x5F84;&#x7684;&#x826F;&#x597D;&#x7406;&#x89E3;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x867D;&#x7136;&#x7528;XML&#x6216;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x6765;&#x7F16;&#x8F91;path&#x5143;&#x7D20;&#x4E0D;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7406;&#x89E3;path&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x5C31;&#x5FCD;&#x4E86;&#x5427;&#x3002;</p>
<p>path&#x5143;&#x7D20;&#x7684;&#x5F62;&#x72B6;&#x662F;&#x901A;&#x8FC7;&#x5C5E;&#x6027;d&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x5C5E;&#x6027;d&#x7684;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x547D;&#x4EE4;+&#x53C2;&#x6570;&#x201D;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BB2;&#x89E3;&#x8FD9;&#x4E9B;&#x53EF;&#x7528;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x5E76;&#x4E14;&#x5C55;&#x793A;&#x4E00;&#x4E9B;&#x793A;&#x4F8B;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x90FD;&#x7528;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x6BCD;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5B57;&#x6BCD;&#x201C;M&#x201D;&#x8868;&#x793A;&#x7684;&#x662F;&#x201C;Move to&#x201D;&#x547D;&#x4EE4;&#xFF0C;&#x5F53;&#x89E3;&#x6790;&#x5668;&#x8BFB;&#x5230;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x65F6;&#xFF0C;&#x5B83;&#x5C31;&#x77E5;&#x9053;&#x4F60;&#x662F;&#x6253;&#x7B97;&#x79FB;&#x52A8;&#x5230;&#x67D0;&#x4E2A;&#x70B9;&#x3002;&#x8DDF;&#x5728;&#x547D;&#x4EE4;&#x5B57;&#x6BCD;&#x540E;&#x9762;&#x7684;&#xFF0C;&#x662F;&#x4F60;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x5230;&#x7684;&#x90A3;&#x4E2A;&#x70B9;&#x7684;x&#x548C;y&#x8F74;&#x5750;&#x6807;&#x3002;&#x6BD4;&#x5982;&#x79FB;&#x52A8;&#x5230;(10,10)&#x8FD9;&#x4E2A;&#x70B9;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x5E94;&#x8BE5;&#x5199;&#x6210;&#x201C;M 10 10&#x201D;&#x3002;&#x8FD9;&#x4E00;&#x6BB5;&#x5B57;&#x7B26;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x89E3;&#x6790;&#x5668;&#x5C31;&#x4F1A;&#x53BB;&#x8BFB;&#x4E0B;&#x4E00;&#x6BB5;&#x547D;&#x4EE4;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x90FD;&#x6709;&#x4E24;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x7528;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#xFF0C;&#x8868;&#x793A;&#x91C7;&#x7528;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x7528;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#xFF0C;&#x8868;&#x793A;&#x91C7;&#x7528;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;&#x4ECE;&#x4E0A;&#x4E00;&#x4E2A;&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x5411;&#x4E0A;&#x79FB;&#x52A8;10px&#xFF0C;&#x5411;&#x5DE6;&#x79FB;&#x52A8;7px&#xFF09;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x5C5E;&#x6027;d&#x91C7;&#x7528;&#x7684;&#x662F;&#x7528;&#x6237;&#x5750;&#x6807;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x9700;&#x6807;&#x660E;&#x5355;&#x4F4D;&#x3002;&#x5728;&#x540E;&#x9762;&#x7684;&#x6559;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5B66;&#x5230;&#x5982;&#x4F55;&#x8BA9;&#x53D8;&#x6362;&#x8DEF;&#x5F84;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x66F4;&#x591A;&#x9700;&#x6C42;&#x3002;</p>
<h2 id="&#x76F4;&#x7EBF;&#x547D;&#x4EE4;">&#x76F4;&#x7EBF;&#x547D;&#x4EE4;</h2>
<p><code>&lt;path&gt;</code>&#x5143;&#x7D20;&#x91CC;&#x6709;5&#x4E2A;&#x753B;&#x76F4;&#x7EBF;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x76F4;&#x7EBF;&#x547D;&#x4EE4;&#x5C31;&#x662F;&#x5728;&#x4E24;&#x4E2A;&#x70B9;&#x4E4B;&#x95F4;&#x753B;&#x76F4;&#x7EBF;&#x3002;&#x9996;&#x5148;&#x662F;&#x201C;Move to&#x201D;&#x547D;&#x4EE4;&#xFF0C;M&#xFF0C;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x5230;&#x7684;&#x70B9;&#x7684;x&#x8F74;&#x548C;y&#x8F74;&#x7684;&#x5750;&#x6807;&#x3002;&#x5047;&#x8BBE;&#xFF0C;&#x4F60;&#x7684;&#x753B;&#x7B14;&#x5F53;&#x524D;&#x4F4D;&#x4E8E;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x5728;&#x4F7F;&#x7528;M&#x547D;&#x4EE4;&#x79FB;&#x52A8;&#x753B;&#x7B14;&#x540E;&#xFF0C;&#x53EA;&#x4F1A;&#x79FB;&#x52A8;&#x753B;&#x7B14;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x5728;&#x4E24;&#x70B9;&#x4E4B;&#x95F4;&#x753B;&#x7EBF;&#x3002;&#x56E0;&#x4E3A;M&#x547D;&#x4EE4;&#x4EC5;&#x4EC5;&#x662F;&#x79FB;&#x52A8;&#x753B;&#x7B14;&#xFF0C;&#x4F46;&#x4E0D;&#x753B;&#x7EBF;&#x3002;&#x6240;&#x4EE5;M&#x547D;&#x4EE4;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x5728;&#x8DEF;&#x5F84;&#x7684;&#x5F00;&#x59CB;&#x5904;&#xFF0C;&#x7528;&#x6765;&#x6307;&#x660E;&#x4ECE;&#x4F55;&#x5904;&#x5F00;&#x59CB;&#x753B;&#x3002;</p>
<pre><code>M x y
</code></pre><p>&#x6216;</p>
<pre><code>m dx dy
</code></pre><p><img src="https://i.loli.net/2018/10/15/5bc40026d00a5.png" alt=""></p>
<p>&#x8FD9;&#x6709;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x6CA1;&#x753B;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x53EA;&#x662F;&#x5C06;&#x753B;&#x7B14;&#x79FB;&#x52A8;&#x5230;&#x8DEF;&#x5F84;&#x7684;&#x8D77;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x4EFB;&#x4F55;&#x56FE;&#x6848;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x628A;&#x6211;&#x4EEC;&#x79FB;&#x52A8;&#x5230;&#x7684;&#x70B9;&#x6807;&#x6CE8;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x91CC;&#x4F1A;&#x770B;&#x5230;(10,10)&#x5750;&#x6807;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x70B9;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x753B;path&#xFF0C;&#x8FD9;&#x91CC;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x4F1A;&#x663E;&#x793A;&#x3002;&#xFF08;&#x8FD9;&#x6BB5;&#x4E0D;&#x592A;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#xFF1A;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x5C55;&#x793A;&#x8DEF;&#x5F84;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x6240;&#x6709;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x5728;&#x7528;path&#x7ED8;&#x5236;&#x8DEF;&#x5F84;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x4F1A;&#x7528;circle&#x6807;&#x6CE8;&#x8DEF;&#x5F84;&#x4E0A;&#x7684;&#x70B9;&#x3002;&#xFF09;</p>
<pre><code>&lt;?xml version=&quot;1.0&quot; standalone=&quot;no&quot;?&gt;

&lt;svg width=&quot;200px&quot; height=&quot;200px&quot; version=&quot;1.1&quot; xmlns=&quot;http://www.w3.org/2000/svg&quot;&gt;

  &lt;path d=&quot;M10 10&quot;/&gt;

  &lt;!-- Points --&gt;
  &lt;circle cx=&quot;10&quot; cy=&quot;10&quot; r=&quot;2&quot; fill=&quot;red&quot;/&gt;

&lt;/svg&gt;
</code></pre><p>&#x80FD;&#x591F;&#x771F;&#x6B63;&#x753B;&#x51FA;&#x7EBF;&#x7684;&#x547D;&#x4EE4;&#x6709;&#x4E09;&#x4E2A;&#xFF08;M&#x547D;&#x4EE4;&#x662F;&#x79FB;&#x52A8;&#x753B;&#x7B14;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x753B;&#x7EBF;&#xFF09;&#xFF0C;&#x6700;&#x5E38;&#x7528;&#x7684;&#x662F;&#x201C;Line to&#x201D;&#x547D;&#x4EE4;&#xFF0C;L&#xFF0C;L&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x4E00;&#x4E2A;&#x70B9;&#x7684;x&#x8F74;&#x548C;y&#x8F74;&#x5750;&#x6807;&#xFF0C;L&#x547D;&#x4EE4;&#x5C06;&#x4F1A;&#x5728;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x548C;&#x65B0;&#x4F4D;&#x7F6E;&#xFF08;L&#x524D;&#x9762;&#x753B;&#x7B14;&#x6240;&#x5728;&#x7684;&#x70B9;&#xFF09;&#x4E4B;&#x95F4;&#x753B;&#x4E00;&#x6761;&#x7EBF;&#x6BB5;&#x3002;</p>
<pre><code>L x y (or l dx dy)
</code></pre><p>&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x7B80;&#x5199;&#x547D;&#x4EE4;&#xFF0C;&#x7528;&#x6765;&#x7ED8;&#x5236;&#x5E73;&#x884C;&#x7EBF;&#x548C;&#x5782;&#x76F4;&#x7EBF;&#x3002;H&#xFF0C;&#x7ED8;&#x5236;&#x5E73;&#x884C;&#x7EBF;&#x3002;V&#xFF0C;&#x7ED8;&#x5236;&#x5782;&#x76F4;&#x7EBF;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x547D;&#x4EE4;&#x90FD;&#x53EA;&#x5E26;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x6807;&#x660E;&#x5728;x&#x8F74;&#x6216;y&#x8F74;&#x79FB;&#x52A8;&#x5230;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x90FD;&#x53EA;&#x5728;&#x5750;&#x6807;&#x8F74;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x79FB;&#x52A8;&#x3002;</p>
<pre><code>H x (or h dx)
 V y (or v dy)
</code></pre><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x4E00;&#x4E9B;&#x547D;&#x4EE4;&#xFF0C;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x753B;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x4E86;&#x3002;&#x5148;&#x4ECE;&#x7B80;&#x5355;&#x7684;&#x5730;&#x65B9;&#x5F00;&#x59CB;&#xFF0C;&#x753B;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x77E9;&#x5F62;&#xFF08;&#x540C;&#x6837;&#x7684;&#x6548;&#x679C;&#x7528;<rect></rect>&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x73B0;&#xFF09;&#xFF0C;&#x77E9;&#x5F62;&#x662F;&#x7531;&#x6C34;&#x5E73;&#x7EBF;&#x548C;&#x5782;&#x76F4;&#x7EBF;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x5C55;&#x73B0;&#x524D;&#x9762;&#x8BB2;&#x7684;&#x753B;&#x7EBF;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p><img src="https://i.loli.net/2018/10/15/5bc40b5bdad93.png" alt="Path_Line_Commands.png"></p>
<pre><code>&lt;?xml version=&quot;1.0&quot; standalone=&quot;no&quot;?&gt;

&lt;svg width=&quot;100px&quot; height=&quot;100px&quot; version=&quot;1.1&quot; xmlns=&quot;http://www.w3.org/2000/svg&quot;&gt;

  &lt;path d=&quot;M10 10 H 90 V 90 H 10 L 10 10&quot;/&gt;

  &lt;!-- Points --&gt;
  &lt;circle cx=&quot;10&quot; cy=&quot;10&quot; r=&quot;2&quot; fill=&quot;red&quot;/&gt;
  &lt;circle cx=&quot;90&quot; cy=&quot;90&quot; r=&quot;2&quot; fill=&quot;red&quot;/&gt;
  &lt;circle cx=&quot;90&quot; cy=&quot;10&quot; r=&quot;2&quot; fill=&quot;red&quot;/&gt;
  &lt;circle cx=&quot;10&quot; cy=&quot;90&quot; r=&quot;2&quot; fill=&quot;red&quot;/&gt;

&lt;/svg&gt;
</code></pre><p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x201C;&#x95ED;&#x5408;&#x8DEF;&#x5F84;&#x547D;&#x4EE4;&#x201D;Z&#x6765;&#x7B80;&#x5316;&#x4E0A;&#x9762;&#x7684;path&#xFF0C;Z&#x547D;&#x4EE4;&#x4F1A;&#x4ECE;&#x5F53;&#x524D;&#x70B9;&#x753B;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x5230;&#x8DEF;&#x5F84;&#x7684;&#x8D77;&#x70B9;&#xFF0C;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x4E0D;&#x603B;&#x662F;&#x9700;&#x8981;&#x95ED;&#x5408;&#x8DEF;&#x5F84;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x8FD8;&#x662F;&#x7ECF;&#x5E38;&#x88AB;&#x653E;&#x5230;&#x8DEF;&#x5F84;&#x7684;&#x6700;&#x540E;&#x3002;&#x53E6;&#x5916;&#xFF0C;Z&#x547D;&#x4EE4;&#x4E0D;&#x7528;&#x533A;&#x5206;&#x5927;&#x5C0F;&#x5199;&#x3002;</p>
<pre><code>Z (or z)
</code></pre><p>&#x6240;&#x4EE5;&#x4E0A;&#x9762;&#x4F8B;&#x5B50;&#x91CC;&#x7528;&#x5230;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x6210;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>&lt;path d=&quot;M10 10 H 90 V 90 H 10 Z&quot; fill=&quot;transparent&quot; stroke=&quot;black&quot;/&gt;
</code></pre><p>&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x7684;&#x76F8;&#x5BF9;&#x5750;&#x6807;&#x5F62;&#x5F0F;&#x6765;&#x7ED8;&#x5236;&#x76F8;&#x540C;&#x7684;&#x56FE;&#x5F62;&#xFF0C;&#x5982;&#x4E4B;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x76F8;&#x5BF9;&#x547D;&#x4EE4;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x53C2;&#x6570;&#x4E0D;&#x662F;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x5750;&#x6807;&#xFF0C;&#x800C;&#x662F;&#x8868;&#x793A;&#x76F8;&#x5BF9;&#x4E8E;&#x5B83;&#x524D;&#x9762;&#x7684;&#x70B9;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x591A;&#x5C11;&#x8DDD;&#x79BB;&#x3002;&#x4F8B;&#x5982;&#x524D;&#x9762;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x753B;&#x7684;&#x662F;&#x4E00;&#x4E2A;<code>80*80</code>&#x7684;&#x6B63;&#x65B9;&#x5F62;&#xFF0C;&#x7528;&#x76F8;&#x5BF9;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x63CF;&#x8FF0;&#xFF1A;</p>
<pre><code>&lt;path d=&quot;M10 10 h 80 v 80 h -80 Z&quot; fill=&quot;transparent&quot; stroke=&quot;black&quot;/&gt;
</code></pre><p>&#x4E0A;&#x8FF0;&#x8DEF;&#x5F84;&#x662F;&#xFF1A;&#x753B;&#x7B14;&#x79FB;&#x52A8;&#x5230;(10,10)&#x70B9;&#xFF0C;&#x7531;&#x6B64;&#x5F00;&#x59CB;&#xFF0C;&#x5411;&#x53F3;&#x79FB;&#x52A8;80&#x50CF;&#x7D20;&#x6784;&#x6210;&#x4E00;&#x6761;&#x6C34;&#x5E73;&#x7EBF;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x4E0B;&#x79FB;&#x52A8;80&#x50CF;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x5DE6;&#x79FB;&#x52A8;80&#x50CF;&#x7D20;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x56DE;&#x5230;&#x8D77;&#x70B9;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;<code>&lt;polygon&gt;</code> &#x548C; <code>&lt;polyline&gt;</code> &#x53EF;&#x4EE5;&#x505A;&#x5230;&#x753B;&#x51FA;&#x4E00;&#x6837;&#x7684;&#x56FE;&#x5F62;&#x3002;&#x7B54;&#x6848;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x66F4;&#x591A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x662F;&#x753B;&#x76F4;&#x7EBF;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x597D;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;path&#x5374;&#x662F;&#x4F17;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x5728;SVG&#x7ED8;&#x5236;&#x4E2D;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#x7684;&#x3002;&#x636E;&#x6211;&#x6240;&#x77E5;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x4E0D;&#x5B58;&#x5728;&#x6027;&#x80FD;&#x4E0A;&#x7684;&#x4F18;&#x52A3;&#x3002;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x811A;&#x672C;&#x751F;&#x6210;path&#x53EF;&#x80FD;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x53E6;&#x5916;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x53EA;&#x9700;&#x8981;&#x6307;&#x660E;&#x70B9;&#xFF0C;&#x800C;path&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x8BED;&#x6CD5;&#x4F1A;&#x66F4;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#x3002;</p>
<h2 id="&#x66F2;&#x7EBF;&#x547D;&#x4EE4;">&#x66F2;&#x7EBF;&#x547D;&#x4EE4;</h2>
<p>&#x7ED8;&#x5236;&#x5E73;&#x6ED1;&#x66F2;&#x7EBF;&#x7684;&#x547D;&#x4EE4;&#x6709;&#x4E09;&#x4E2A;&#xFF0C;&#x5176;&#x4E2D;&#x4E24;&#x4E2A;&#x7528;&#x6765;&#x7ED8;&#x5236;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x7ED8;&#x5236;&#x5F27;&#x5F62;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x5706;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;Inkscape&#x3001;Illustrator&#x6216;&#x8005;Photoshop&#x4E2D;&#x7528;&#x8FC7;&#x8DEF;&#x5F84;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x80FD;&#x5BF9;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x6709;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x6B32;&#x4E86;&#x89E3;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x7684;&#x5B8C;&#x6574;&#x6570;&#x5B66;&#x8BB2;&#x89E3;&#xFF0C;&#x8BF7;&#x9605;&#x8BFB;&#x8FD9;&#x4EFD;Wikipedia&#x7684;&#x6587;&#x6863;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x4E0D;&#x7528;&#x8BB2;&#x5F97;&#x592A;&#x591A;&#x3002;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x7684;&#x7C7B;&#x578B;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x5728;path&#x5143;&#x7D20;&#x91CC;&#xFF0C;&#x53EA;&#x5B58;&#x5728;&#x4E24;&#x79CD;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#xFF1A;&#x4E09;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;C&#xFF0C;&#x548C;&#x4E8C;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;Q&#x3002;</p>
<h3 id="&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;">&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;</h3>
<p>&#x6211;&#x4EEC;&#x4ECE;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x4E00;&#x70B9;&#x7684;&#x4E09;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;C&#x5165;&#x624B;&#xFF0C;&#x4E09;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x70B9;&#x548C;&#x4E24;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x7528;C&#x547D;&#x4EE4;&#x521B;&#x5EFA;&#x4E09;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E09;&#x7EC4;&#x5750;&#x6807;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>C x1 y1, x2 y2, x y (or c dx1 dy1, dx2 dy2, dx dy)
</code></pre><p>&#x8FD9;&#x91CC;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5750;&#x6807;(x,y)&#x8868;&#x793A;&#x7684;&#x662F;&#x66F2;&#x7EBF;&#x7684;&#x7EC8;&#x70B9;&#xFF0C;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x5750;&#x6807;&#x662F;&#x63A7;&#x5236;&#x70B9;&#xFF0C;(x1,y1)&#x662F;&#x8D77;&#x70B9;&#x7684;&#x63A7;&#x5236;&#x70B9;&#xFF0C;(x2,y2)&#x662F;&#x7EC8;&#x70B9;&#x7684;&#x63A7;&#x5236;&#x70B9;&#x3002;&#x5982;&#x679C;&#x4F60;&#x719F;&#x6089;&#x4EE3;&#x6570;&#x6216;&#x8005;&#x5FAE;&#x79EF;&#x5206;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x63A7;&#x5236;&#x70B9;&#xFF0C;&#x63A7;&#x5236;&#x70B9;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x66F2;&#x7EBF;&#x8D77;&#x59CB;&#x70B9;&#x7684;&#x659C;&#x7387;&#xFF0C;&#x66F2;&#x7EBF;&#x4E0A;&#x5404;&#x4E2A;&#x70B9;&#x7684;&#x659C;&#x7387;&#xFF0C;&#x662F;&#x4ECE;&#x8D77;&#x70B9;&#x659C;&#x7387;&#x5230;&#x7EC8;&#x70B9;&#x659C;&#x7387;&#x7684;&#x6E10;&#x53D8;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="https://i.loli.net/2018/10/15/5bc40b9ed99e6.png" alt="Cubic_Bezier_Curves.png"></p>
<pre><code>&lt;?xml version=&quot;1.0&quot; standalone=&quot;no&quot;?&gt;

&lt;svg width=&quot;190px&quot; height=&quot;160px&quot; version=&quot;1.1&quot; xmlns=&quot;http://www.w3.org/2000/svg&quot;&gt;

  &lt;path d=&quot;M10 10 C 20 20, 40 20, 50 10&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
  &lt;path d=&quot;M70 10 C 70 20, 120 20, 120 10&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
  &lt;path d=&quot;M130 10 C 120 20, 180 20, 170 10&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
  &lt;path d=&quot;M10 60 C 20 80, 40 80, 50 60&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
  &lt;path d=&quot;M70 60 C 70 80, 110 80, 110 60&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
  &lt;path d=&quot;M130 60 C 120 80, 180 80, 170 60&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
  &lt;path d=&quot;M10 110 C 20 140, 40 140, 50 110&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
  &lt;path d=&quot;M70 110 C 70 140, 110 140, 110 110&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
  &lt;path d=&quot;M130 110 C 120 140, 180 140, 170 110&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;

&lt;/svg&gt;
</code></pre><p>&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x521B;&#x5EFA;&#x4E86;9&#x4E2A;&#x4E09;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x3002;&#x6709;&#x4E00;&#x70B9;&#x6BD4;&#x8F83;&#x9057;&#x61BE;&#xFF0C;&#x6807;&#x8BB0;&#x63A7;&#x5236;&#x70B9;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x6BD4;&#x8F83;&#x5E9E;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x820D;&#x5F03;&#x4E86;&#x3002;&#xFF08;&#x4E4B;&#x524D;&#x6240;&#x6709;&#x70B9;&#x90FD;&#x7528;circle&#x6807;&#x8BB0;&#xFF0C;&#x6B64;&#x5904;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6CA1;&#x628A;&#x4EE3;&#x7801;&#x5217;&#x51FA;&#x6765;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x63A7;&#x5236;&#x5B83;&#x4EEC;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x628A;&#x4ED6;&#x4EEC;&#x753B;&#x51FA;&#x6765;&#x3002;&#x56FE;&#x4F8B;&#x4E0A;&#x7684;&#x66F2;&#x7EBF;&#x4ECE;&#x5DE6;&#x5F80;&#x53F3;&#x770B;&#xFF0C;&#x63A7;&#x5236;&#x70B9;&#x5728;&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x4E0A;&#x9010;&#x6E10;&#x5206;&#x5F00;&#xFF0C;&#x56FE;&#x4F8B;&#x4E0A;&#x7684;&#x66F2;&#x7EBF;&#x4ECE;&#x53F3;&#x5F80;&#x5DE6;&#x770B;&#xFF0C;&#x63A7;&#x5236;&#x70B9;&#x4E4B;&#x95F4;&#x79BB;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x8FDC;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x89C2;&#x5BDF;&#xFF0C;&#x66F2;&#x7EBF;&#x6CBF;&#x7740;&#x8D77;&#x70B9;&#x5230;&#x7B2C;&#x4E00;&#x63A7;&#x5236;&#x70B9;&#x7684;&#x65B9;&#x5411;&#x4F38;&#x51FA;&#xFF0C;&#x9010;&#x6E10;&#x5F2F;&#x66F2;&#xFF0C;&#x7136;&#x540E;&#x6CBF;&#x7740;&#x7B2C;&#x4E8C;&#x63A7;&#x5236;&#x70B9;&#x5230;&#x7EC8;&#x70B9;&#x7684;&#x65B9;&#x5411;&#x7ED3;&#x675F;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x82E5;&#x5E72;&#x4E2A;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x8FDE;&#x8D77;&#x6765;&#xFF0C;&#x4ECE;&#x800C;&#x521B;&#x5EFA;&#x51FA;&#x4E00;&#x6761;&#x5F88;&#x957F;&#x7684;&#x5E73;&#x6ED1;&#x66F2;&#x7EBF;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x70B9;&#x67D0;&#x4E00;&#x4FA7;&#x7684;&#x63A7;&#x5236;&#x70B9;&#x662F;&#x5B83;&#x53E6;&#x4E00;&#x4FA7;&#x7684;&#x63A7;&#x5236;&#x70B9;&#x7684;&#x5BF9;&#x79F0;&#xFF08;&#x4EE5;&#x4FDD;&#x6301;&#x659C;&#x7387;&#x4E0D;&#x53D8;&#xFF09;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5199;&#x7684;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x547D;&#x4EE4;S&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="https://i.loli.net/2018/10/15/5bc40bc964dd3.png" alt="ShortCut_Cubic_Bezier.png"></p>
<pre><code>S x2 y2, x y (or s dx2 dy2, dx dy)
</code></pre><p>S&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x4E0E;&#x4E4B;&#x524D;&#x90A3;&#x4E9B;&#x66F2;&#x7EBF;&#x4E00;&#x6837;&#x7684;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;S&#x547D;&#x4EE4;&#x8DDF;&#x5728;&#x4E00;&#x4E2A;C&#x547D;&#x4EE4;&#x6216;&#x8005;&#x53E6;&#x4E00;&#x4E2A;S&#x547D;&#x4EE4;&#x7684;&#x540E;&#x9762;&#xFF0C;&#x5B83;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#xFF0C;&#x5C31;&#x4F1A;&#x88AB;&#x5047;&#x8BBE;&#x6210;&#x524D;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#x7684;&#x5BF9;&#x79F0;&#x70B9;&#x3002;&#x5982;&#x679C;S&#x547D;&#x4EE4;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#xFF0C;&#x524D;&#x9762;&#x6CA1;&#x6709;C&#x547D;&#x4EE4;&#x6216;&#x8005;&#x53E6;&#x4E00;&#x4E2A;S&#x547D;&#x4EE4;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x4E24;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#x5C31;&#x4F1A;&#x88AB;&#x5047;&#x8BBE;&#x4E3A;&#x540C;&#x4E00;&#x4E2A;&#x70B9;&#x3002;&#x4E0B;&#x9762;&#x662F;S&#x547D;&#x4EE4;&#x7684;&#x8BED;&#x6CD5;&#x793A;&#x4F8B;&#xFF0C;&#x53F3;&#x56FE;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#x7528;&#x7EA2;&#x8272;&#x6807;&#x793A;&#xFF0C;&#x4E0E;&#x5B83;&#x5BF9;&#x79F0;&#x7684;&#x63A7;&#x5236;&#x70B9;&#x7528;&#x84DD;&#x8272;&#x6807;&#x793A;&#x3002;</p>
<pre><code>&lt;?xml version=&quot;1.0&quot; standalone=&quot;no&quot;?&gt;
&lt;svg width=&quot;190px&quot; height=&quot;160px&quot; version=&quot;1.1&quot; xmlns=&quot;http://www.w3.org/2000/svg&quot;&gt;
  &lt;path d=&quot;M10 80 C 40 10, 65 10, 95 80 S 150 150, 180 80&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
&lt;/svg&gt;
</code></pre><p>&#x53E6;&#x4E00;&#x79CD;&#x53EF;&#x7528;&#x7684;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x662F;&#x4E8C;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;Q&#xFF0C;&#x5B83;&#x6BD4;&#x4E09;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#xFF0C;&#x7528;&#x6765;&#x786E;&#x5B9A;&#x8D77;&#x70B9;&#x548C;&#x7EC8;&#x70B9;&#x7684;&#x66F2;&#x7EBF;&#x659C;&#x7387;&#x3002;&#x56E0;&#x6B64;&#x5B83;&#x9700;&#x8981;&#x4E24;&#x7EC4;&#x53C2;&#x6570;&#xFF0C;&#x63A7;&#x5236;&#x70B9;&#x548C;&#x7EC8;&#x70B9;&#x5750;&#x6807;&#x3002;</p>
<pre><code>Q x1 y1, x y (or q dx1 dy1, dx dy)
</code></pre><p><img src="https://i.loli.net/2018/10/15/5bc40bf9c9186.png" alt="Quadratic_Bezier.png"></p>
<pre><code>&lt;?xml version=&quot;1.0&quot; standalone=&quot;no&quot;?&gt;
&lt;svg width=&quot;190px&quot; height=&quot;160px&quot; version=&quot;1.1&quot; xmlns=&quot;http://www.w3.org/2000/svg&quot;&quot;&gt;
  &lt;path d=&quot;M10 80 Q 95 10 180 80&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
&lt;/svg&gt;
</code></pre><p>&#x5C31;&#x50CF;&#x4E09;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x6709;&#x4E00;&#x4E2A;S&#x547D;&#x4EE4;&#xFF0C;&#x4E8C;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x6709;&#x4E00;&#x4E2A;&#x5DEE;&#x4E0D;&#x591A;&#x7684;T&#x547D;&#x4EE4;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x66F4;&#x7B80;&#x77ED;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5EF6;&#x957F;&#x4E8C;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x3002;</p>
<pre><code>T x y (or t dx dy)
</code></pre><p>&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x5FEB;&#x6377;&#x547D;&#x4EE4;T&#x4F1A;&#x901A;&#x8FC7;&#x524D;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#xFF0C;&#x63A8;&#x65AD;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x63A7;&#x5236;&#x70B9;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5728;&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x70B9;&#x540E;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x53EA;&#x5B9A;&#x4E49;&#x7EC8;&#x70B9;&#xFF0C;&#x5C31;&#x521B;&#x5EFA;&#x51FA;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7684;&#x66F2;&#x7EBF;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;T&#x547D;&#x4EE4;&#x524D;&#x9762;&#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;Q&#x547D;&#x4EE4;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x53E6;&#x4E00;&#x4E2A;T&#x547D;&#x4EE4;&#xFF0C;&#x624D;&#x80FD;&#x8FBE;&#x5230;&#x8FD9;&#x79CD;&#x6548;&#x679C;&#x3002;&#x5982;&#x679C;T&#x5355;&#x72EC;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x63A7;&#x5236;&#x70B9;&#x5C31;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x548C;&#x7EC8;&#x70B9;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x753B;&#x51FA;&#x6765;&#x7684;&#x5C06;&#x662F;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x3002;</p>
<p><img src="https://i.loli.net/2018/10/15/5bc40c2fe6e6b.png" alt="Shortcut_Quadratic_Bezier.png"></p>
<pre><code>&lt;?xml version=&quot;1.0&quot; standalone=&quot;no&quot;?&gt;
&lt;svg width=&quot;190px&quot; height=&quot;160px&quot; version=&quot;1.1&quot; xmlns=&quot;http://www.w3.org/2000/svg&quot;&gt;
  &lt;path d=&quot;M10 80 Q 52.5 10, 95 80 T 180 80&quot; stroke=&quot;black&quot; fill=&quot;transparent&quot;/&gt;
&lt;/svg&gt;
</code></pre><p>&#x867D;&#x7136;&#x4E09;&#x6B21;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x62E5;&#x6709;&#x66F4;&#x5927;&#x7684;&#x81EA;&#x7531;&#x5EA6;&#xFF0C;&#x4F46;&#x662F;&#x4E24;&#x79CD;&#x66F2;&#x7EBF;&#x80FD;&#x8FBE;&#x5230;&#x7684;&#x6548;&#x679C;&#x603B;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x3002;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x66F2;&#x7EBF;&#xFF0C;&#x901A;&#x5E38;&#x53D6;&#x51B3;&#x4E8E;&#x9700;&#x6C42;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x66F2;&#x7EBF;&#x5BF9;&#x79F0;&#x6027;&#x7684;&#x4F9D;&#x8D56;&#x7A0B;&#x5EA6;&#x3002;</p>
<h2 id="&#x5F27;&#x5F62;">&#x5F27;&#x5F62;</h2>
<p>&#x5F27;&#x5F62;&#x547D;&#x4EE4;A&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x521B;&#x5EFA;SVG&#x66F2;&#x7EBF;&#x7684;&#x547D;&#x4EE4;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x5F27;&#x5F62;&#x53EF;&#x4EE5;&#x89C6;&#x4E3A;&#x5706;&#x5F62;&#x6216;&#x692D;&#x5706;&#x5F62;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5047;&#x8BBE;&#xFF0C;&#x5DF2;&#x77E5;&#x692D;&#x5706;&#x5F62;&#x7684;&#x957F;&#x8F74;&#x534A;&#x5F84;&#x548C;&#x77ED;&#x8F74;&#x534A;&#x5F84;&#xFF0C;&#x5E76;&#x4E14;&#x5DF2;&#x77E5;&#x4E24;&#x4E2A;&#x70B9;&#xFF08;&#x5728;&#x692D;&#x5706;&#x4E0A;&#xFF09;&#xFF0C;&#x6839;&#x636E;&#x534A;&#x5F84;&#x548C;&#x4E24;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x753B;&#x51FA;&#x4E24;&#x4E2A;&#x692D;&#x5706;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x692D;&#x5706;&#x4E0A;&#x6839;&#x636E;&#x4E24;&#x70B9;&#x90FD;&#x53EF;&#x4EE5;&#x753B;&#x51FA;&#x4E24;&#x79CD;&#x5F27;&#x5F62;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4EC5;&#x4EC5;&#x6839;&#x636E;&#x534A;&#x5F84;&#x548C;&#x4E24;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x753B;&#x51FA;&#x56DB;&#x79CD;&#x5F27;&#x5F62;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x521B;&#x5EFA;&#x7684;&#x5F27;&#x5F62;&#x552F;&#x4E00;&#xFF0C;A&#x547D;&#x4EE4;&#x9700;&#x8981;&#x7528;&#x5230;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>A rx ry x-axis-rotation large-arc-flag sweep-flag x y
 a rx ry x-axis-rotation large-arc-flag sweep-flag dx dy
</code></pre><p>&#x5F27;&#x5F62;&#x547D;&#x4EE4;A&#x7684;&#x524D;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x5206;&#x522B;&#x662F;x&#x8F74;&#x534A;&#x5F84;&#x548C;y&#x8F74;&#x534A;&#x5F84;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4F5C;&#x7528;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x4E0D;&#x7528;&#x591A;&#x505A;&#x89E3;&#x91CA;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#x5B83;&#x4EEC;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x4E00;&#x4E0B;&#x692D;&#x5706;ellipse&#x547D;&#x4EE4;&#x4E2D;&#x7684;&#x76F8;&#x540C;&#x53C2;&#x6570;&#x3002;&#x5F27;&#x5F62;&#x547D;&#x4EE4;A&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x8868;&#x793A;&#x5F27;&#x5F62;&#x7684;&#x65CB;&#x8F6C;&#x60C5;&#x51B5;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x89E3;&#x91CA;&#x5B83;&#xFF1A;</p>
<p><img src="https://i.loli.net/2018/10/15/5bc40c6428d1e.png" alt="SVGArcs_XAxisRotation.png"></p>
<pre><code>&lt;?xml version=&quot;1.0&quot; standalone=&quot;no&quot;?&gt;
&lt;svg width=&quot;320px&quot; height=&quot;320px&quot; version=&quot;1.1&quot; xmlns=&quot;http://www.w3.org/2000/svg&quot;&gt;
  &lt;path d=&quot;M10 315
           L 110 215
           A 30 50 0 0 1 162.55 162.45
           L 172.55 152.45
           A 30 50 -45 0 1 215.1 109.9
           L 315 10&quot; stroke=&quot;black&quot; fill=&quot;green&quot; stroke-width=&quot;2&quot; fill-opacity=&quot;0.5&quot;/&gt;
&lt;/svg&gt;
</code></pre><p>&#x5982;&#x56FE;&#x4F8B;&#x6240;&#x793A;&#xFF0C;&#x753B;&#x5E03;&#x4E0A;&#x6709;&#x4E00;&#x6761;&#x5BF9;&#x89D2;&#x7EBF;&#xFF0C;&#x4E2D;&#x95F4;&#x6709;&#x4E24;&#x4E2A;&#x692D;&#x5706;&#x5F27;&#x88AB;&#x5BF9;&#x89D2;&#x7EBF;&#x5207;&#x5F00;(x radius = 30, y radius = 50)&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x692D;&#x5706;&#x5F27;&#x7684;x-axis-rotation&#xFF08;x&#x8F74;&#x65CB;&#x8F6C;&#x89D2;&#x5EA6;&#xFF09;&#x662F;0&#xFF0C;&#x6240;&#x4EE5;&#x5F27;&#x5F62;&#x6240;&#x5728;&#x7684;&#x692D;&#x5706;&#x662F;&#x6B63;&#x7F6E;&#x7684;&#xFF08;&#x6CA1;&#x6709;&#x503E;&#x659C;&#xFF09;&#x3002;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x692D;&#x5706;&#x5F27;&#x4E2D;&#xFF0C;x-axis-rotation&#x8BBE;&#x7F6E;&#x4E3A;-45&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x65CB;&#x8F6C;&#x4E86;45&#x5EA6;&#x7684;&#x692D;&#x5706;&#xFF0C;&#x5E76;&#x4EE5;&#x77ED;&#x8F74;&#x4E3A;&#x5206;&#x5272;&#x7EBF;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x4E24;&#x4E2A;&#x5BF9;&#x79F0;&#x7684;&#x5F27;&#x5F62;&#x3002;&#x53C2;&#x770B;&#x56FE;&#x793A;&#x4E2D;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x692D;&#x5706;&#x5F62;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E0A;&#x56FE;&#x6CA1;&#x6709;&#x65CB;&#x8F6C;&#x7684;&#x692D;&#x5706;&#xFF0C;&#x53EA;&#x6709;2&#x79CD;&#x5F27;&#x5F62;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#xFF0C;&#x4E0D;&#x662F;4&#x79CD;&#xFF0C;&#x56E0;&#x4E3A;&#x4E24;&#x70B9;&#x8FDE;&#x7EBF;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5BF9;&#x89D2;&#x7EBF;&#xFF09;&#x6B63;&#x597D;&#x7A7F;&#x8FC7;&#x4E86;&#x692D;&#x5706;&#x7684;&#x4E2D;&#x5FC3;&#x3002;&#x50CF;&#x4E0B;&#x9762;&#x8FD9;&#x5F20;&#x56FE;&#xFF0C;&#x5C31;&#x662F;&#x666E;&#x901A;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x753B;&#x51FA;&#x4E24;&#x4E2A;&#x692D;&#x5706;&#xFF0C;&#x56DB;&#x79CD;&#x5F27;&#x3002;</p>
<p><img src="https://i.loli.net/2018/10/15/5bc40c706f865.png" alt="SVGArcs_XAxisRotation_with_grid_ellipses.png"></p>
<p>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x56DB;&#x79CD;&#x4E0D;&#x540C;&#x8DEF;&#x5F84;&#x5C06;&#x7531;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x51B3;&#x5B9A;&#x3002;&#x5982;&#x524D;&#x6240;&#x8BB2;&#xFF0C;&#x8FD8;&#x6709;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x692D;&#x5706;&#x7528;&#x6765;&#x5F62;&#x6210;&#x8DEF;&#x5F84;&#xFF0C;&#x5B83;&#x4EEC;&#x7ED9;&#x51FA;&#x7684;&#x56DB;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x8DEF;&#x5F84;&#x4E2D;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8DEF;&#x5F84;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x8BB2;&#x7684;&#x53C2;&#x6570;&#x662F;large-arc-flag&#xFF08;&#x89D2;&#x5EA6;&#x5927;&#x5C0F;&#xFF09; &#x548C;sweep-flag&#xFF08;&#x5F27;&#x7EBF;&#x65B9;&#x5411;&#xFF09;&#xFF0C;large-arc-flag&#x51B3;&#x5B9A;&#x5F27;&#x7EBF;&#x662F;&#x5927;&#x4E8E;&#x8FD8;&#x662F;&#x5C0F;&#x4E8E;180&#x5EA6;&#xFF0C;0&#x8868;&#x793A;&#x5C0F;&#x89D2;&#x5EA6;&#x5F27;&#xFF0C;1&#x8868;&#x793A;&#x5927;&#x89D2;&#x5EA6;&#x5F27;&#x3002;sweep-flag&#x8868;&#x793A;&#x5F27;&#x7EBF;&#x7684;&#x65B9;&#x5411;&#xFF0C;0&#x8868;&#x793A;&#x4ECE;&#x8D77;&#x70B9;&#x5230;&#x7EC8;&#x70B9;&#x6CBF;&#x9006;&#x65F6;&#x9488;&#x753B;&#x5F27;&#xFF0C;1&#x8868;&#x793A;&#x4ECE;&#x8D77;&#x70B9;&#x5230;&#x7EC8;&#x70B9;&#x6CBF;&#x987A;&#x65F6;&#x9488;&#x753B;&#x5F27;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x5C55;&#x793A;&#x4E86;&#x8FD9;&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p><img src="https://i.loli.net/2018/10/15/5bc40c70ce873.png" alt="SVGArcs_Flags.png"></p>
<pre><code>&lt;?xml version=&quot;1.0&quot; standalone=&quot;no&quot;?&gt;
&lt;svg width=&quot;325px&quot; height=&quot;325px&quot; version=&quot;1.1&quot; xmlns=&quot;http://www.w3.org/2000/svg&quot;&gt;
  &lt;path d=&quot;M80 80
           A 45 45, 0, 0, 0, 125 125
           L 125 80 Z&quot; fill=&quot;green&quot;/&gt;
  &lt;path d=&quot;M230 80
           A 45 45, 0, 1, 0, 275 125
           L 275 80 Z&quot; fill=&quot;red&quot;/&gt;
  &lt;path d=&quot;M80 230
           A 45 45, 0, 0, 1, 125 275
           L 125 230 Z&quot; fill=&quot;purple&quot;/&gt;
  &lt;path d=&quot;M230 230
           A 45 45, 0, 1, 1, 275 275
           L 275 230 Z&quot; fill=&quot;blue&quot;/&gt;
&lt;/svg&gt;
</code></pre><p>&#x4F60;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x731C;&#x5230;&#x4E86;&#xFF0C;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x6307;&#x5B9A;&#x5F27;&#x5F62;&#x7684;&#x7EC8;&#x70B9;&#xFF0C;&#x5F27;&#x5F62;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x521B;&#x5EFA;&#x5706;&#x5F62;&#x6216;&#x692D;&#x5706;&#x5F62;&#x56FE;&#x6807;&#xFF0C;&#x6BD4;&#x5982;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x82E5;&#x5E72;&#x7247;&#x5F27;&#x5F62;&#xFF0C;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x997C;&#x56FE;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x662F;&#x4ECE;Canvas&#x8FC7;&#x6E21;&#x5230;SVG&#xFF0C;&#x90A3;&#x4E48;&#x5F27;&#x5F62;&#x4F1A;&#x6BD4;&#x8F83;&#x96BE;&#x4EE5;&#x638C;&#x63E1;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x7684;&#x3002;&#x7528;&#x8DEF;&#x5F84;&#x6765;&#x7ED8;&#x5236;&#x5B8C;&#x6574;&#x7684;&#x5706;&#x6216;&#x8005;&#x692D;&#x5706;&#x662F;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5706;&#x4E0A;&#x7684;&#x4EFB;&#x610F;&#x70B9;&#x90FD;&#x53EF;&#x4EE5;&#x662F;&#x8D77;&#x70B9;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x7EC8;&#x70B9;&#xFF0C;&#x65E0;&#x6570;&#x79CD;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x8DEF;&#x5F84;&#x65E0;&#x6CD5;&#x5B9A;&#x4E49;&#x3002;&#x901A;&#x8FC7;&#x7ED8;&#x5236;&#x8FDE;&#x7EED;&#x7684;&#x8DEF;&#x5F84;&#x6BB5;&#x843D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x8FD1;&#x4F3C;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x4F7F;&#x7528;&#x771F;&#x6B63;&#x7684;circle&#x6216;&#x8005;ellipse&#x5143;&#x7D20;&#x4F1A;&#x66F4;&#x5BB9;&#x6613;&#x4E00;&#x4E9B;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;">&#x53C2;&#x8003;</h2>
<ul>
<li><a href="https://developer.mozilla.org/zh-CN/docs/Web/SVG/Tutorial/Paths" target="_blank">wiki</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                

            </div>

            
                
                <a href="basic_shape.html" class="navigation navigation-prev " aria-label="Previous page: 基本形状">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="fill_and_stroke.html" class="navigation navigation-next " aria-label="Next page: 填充与边框">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"路径","level":"1.2.5","depth":2,"next":{"title":"填充与边框","level":"1.2.6","depth":2,"path":"chapter1/fill_and_stroke.md","ref":"chapter1/fill_and_stroke.md","articles":[]},"previous":{"title":"基本形状","level":"1.2.4","depth":2,"path":"chapter1/basic_shape.md","ref":"chapter1/basic_shape.md","articles":[]},"dir":"ltr"},"config":{"plugins":["edit-link","theme-vuejs-2","-fontsettings","-highlight","github"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"edit-link":{"label":"Edit This Page","base":"https://github.com/jirengu/svg-you-should-know/tree/master/docs"},"github":{"url":"https://github.com/jirengu/css-you-should-know/"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-vuejs-2":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"svg you should know","language":"zh-cn","links":{"sharing":{"facebook":false,"twitter":false}},"gitbook":"*"},"file":{"path":"chapter1/path.md","mtime":"2018-10-15T03:43:07.287Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2018-10-15T08:11:01.404Z"},"basePath":"..","book":{"language":"zh-cn"}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    

    </body>
</html>

